In [1]:
import pandas as pd
import numpy as np

## DataFrame 기본

In [2]:
two_dimensional_list = [['dongwook', 50, 86], ['ikjoong', 68, 91], ['yoonsoo', 88, 75], ['sineul', 89, 31]]

In [3]:
my_df = pd.DataFrame(two_dimensional_list, columns = ['name', 'english_score', 'math_score'], index = ['a', 'b', 'c', 'd'])
my_df

       name  english_score  math_score
a  dongwook             50          86
b   ikjoong             68          91
c   yoonsoo             88          75
d    sineul             89          31

In [4]:
type(my_df)

pandas.core.frame.DataFrame

In [5]:
my_df.columns

Index(['name', 'english_score', 'math_score'], dtype='object')

In [6]:
my_df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [7]:
my_df.dtypes # 같은 column 내에선 같은 자료형

name             object
english_score     int64
math_score        int64
dtype: object

## DataFrame을 만드는 다양한 방법

In [8]:
# list
two_dimensional_array = np.array(two_dimensional_list)

In [9]:
list_of_series = [
    pd.Series(['dongwook', 50, 86]),
    pd.Series(['ikjoong', 68, 91]),
    pd.Series(['yoonsoo', 88, 75]),
    pd.Series(['sineul', 89, 31])
]

In [10]:
df1 = pd.DataFrame(two_dimensional_list)
df2 = pd.DataFrame(two_dimensional_array)
df3 = pd.DataFrame(list_of_series)

In [11]:
# 모두 동일
print(df1)  # 파이썬의 list로 만든 것
print(df2)  # numpy의 array로 만든 것
print(df3)  # pandas의 Series로 만든 것

          0   1   2
0  dongwook  50  86
1   ikjoong  68  91
2   yoonsoo  88  75
3    sineul  89  31
          0   1   2
0  dongwook  50  86
1   ikjoong  68  91
2   yoonsoo  88  75
3    sineul  89  31
          0   1   2
0  dongwook  50  86
1   ikjoong  68  91
2   yoonsoo  88  75
3    sineul  89  31

In [12]:
# dictionary
names = ['dongwook', 'sineui', 'ikjoong', 'yoonsoo']
english_scores = [50, 89, 68, 88]
math_scores = [86, 31, 91, 75]

In [13]:
dict1 = {
    'name': names, 
    'english_score': english_scores, 
    'math_score': math_scores
}

dict2 = {
    'name': np.array(names), 
    'english_score': np.array(english_scores), 
    'math_score': np.array(math_scores)
}

dict3 = {
    'name': pd.Series(names), 
    'english_score': pd.Series(english_scores), 
    'math_score': pd.Series(math_scores)
}

In [14]:
df1 = pd.DataFrame(dict1)
df2 = pd.DataFrame(dict2)
df3 = pd.DataFrame(dict3)

In [15]:
# 모두 동일
print(df1)  # 파이썬의 dictionary로 만든 것
print(df2)  # numpy의 array로 만든 것
print(df3)  # pandas의 Series로 만든 것

       name  english_score  math_score
0  dongwook             50          86
1    sineui             89          31
2   ikjoong             68          91
3   yoonsoo             88          75
       name  english_score  math_score
0  dongwook             50          86
1    sineui             89          31
2   ikjoong             68          91
3   yoonsoo             88          75
       name  english_score  math_score
0  dongwook             50          86
1    sineui             89          31
2   ikjoong             68          91
3   yoonsoo             88          75

In [16]:
# dicts가 담긴 리스트
my_list = [
    {'name': 'dongwook', 'english_score': 50, 'math_score': 86},
    {'name': 'sineui', 'english_score': 89, 'math_score': 31},
    {'name': 'ikjoong', 'english_score': 68, 'math_score': 91},
    {'name': 'yoonsoo', 'english_score': 88, 'math_score': 75}
]

In [17]:
df = pd.DataFrame(my_list)
df

       name  english_score  math_score
0  dongwook             50          86
1    sineui             89          31
2   ikjoong             68          91
3   yoonsoo             88          75

## 데이터 읽어드리기(csv)

In [18]:
iphone_df = pd.read_csv('data/iphone.csv', index_col = 0)
iphone_df

                      출시일  디스플레이  메모리     출시 버전 Face ID
iPhone 7       2016-09-16    4.7  2GB  iOS 10.0      No
iPhone 7 Plus  2016-09-16    5.5  3GB  iOS 10.0      No
iPhone 8       2017-09-22    4.7  2GB  iOS 11.0      No
iPhone 8 Plus  2017-09-22    5.5  3GB  iOS 11.0      No
iPhone X       2017-11-03    5.8  3GB  iOS 11.1     Yes
iPhone XS      2018-09-21    5.8  4GB  iOS 12.0     Yes
iPhone XS Max  2018-09-21    6.5  4GB  iOS 12.0     Yes